In [6]:
import pandas as pd
import numpy as np

In [3]:
#1.	Write a Pandas program to create and display a one-dimensional array-like object containing an array of data using Pandas module.
a=pd.Series([1,2,3,4,5,6,6,7])
print(a)

0    1
1    2
2    3
3    4
4    5
5    6
6    6
7    7
dtype: int64

In [4]:
#2.	Write a pandas program to convert a pandas module series to python list.
print(a.tolist())

[1, 2, 3, 4, 5, 6, 6, 7]

In [8]:
#3.	Write a pandas program to add, subtract, multiple and divide two pandas series
a=pd.Series(np.arange(1,10))
b=pd.Series(np.arange(10,20))
print("add",a+b)
print("sub",a-b)
print("mul",a*b)
print("div",a/b)
print("moddiv",a%b)

add 0    11.0
1    13.0
2    15.0
3    17.0
4    19.0
5    21.0
6    23.0
7    25.0
8    27.0
9     NaN
dtype: float64
sub 0   -9.0
1   -9.0
2   -9.0
3   -9.0
4   -9.0
5   -9.0
6   -9.0
7   -9.0
8   -9.0
9    NaN
dtype: float64
mul 0     10.0
1     22.0
2     36.0
3     52.0
4     70.0
5     90.0
6    112.0
7    136.0
8    162.0
9      NaN
dtype: float64
div 0    0.100000
1    0.181818
2    0.250000
3    0.307692
4    0.357143
5    0.400000
6    0.437500
7    0.470588
8    0.500000
9         NaN
dtype: float64
moddiv 0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
7    8.0
8    9.0
9    NaN
dtype: float64

In [15]:
#4.	Write a Pandas program to convert all the string values to upper, lower cases in a given pandas series. Also find the length of the string values.
a=pd.Series(['A','sRavani','akhila','MaheswaRI','bhargavi'])

print("upper",a.str.upper(),sep="\n")
print("lower",a.str.lower(),sep="\n")
print("length of string",a.str.len())

upper
0            A
1      SRAVANI
2       AKHILA
3    MAHESWARI
4     BHARGAVI
dtype: object
lower
0            a
1      sravani
2       akhila
3    maheswari
4     bhargavi
dtype: object
length of string 0    1
1    7
2    6
3    9
4    8
dtype: int64

In [20]:
#5.	Write a Pandas program to remove whitespaces, left sided whitespaces and right sided whitespaces of the string values of a given pandas series
a=pd.Series(['A',' BC ','BHM ',' JIOYHOL','dcdc'])
print("original:\n",a)
a=a.str.strip()
print("after removing\n",a)

original:
 0           A
1         BC
2        BHM
3     JIOYHOL
4        dcdc
dtype: object
after removing
 0          A
1         BC
2        BHM
3    JIOYHOL
4       dcdc
dtype: object

In [28]:
#6.	Write a Pandas program to create and display a DataFrame consist of student name, father name , mobile number as columns and register number as index.
data={"regtno":['y20cs099','y20cs100','y20cs101','y20cs102'],"std_name":['sravani','akhila','maheswari','bhargavi'],"fathername":['abc','xyz','poi','hdbk']
     ,"mobilenumber":[123456,498765,637389,84840]}
df=pd.DataFrame(data)
df.reindex(df["regtno"])
df

     regtno   std_name fathername  mobilenumber
0  y20cs099    sravani        abc        123456
1  y20cs100     akhila        xyz        498765
2  y20cs101  maheswari        poi        637389
3  y20cs102   bhargavi       hdbk         84840

In [29]:
#7.	Write a Pandas program to get list from DataFrame column headers.
print(df.columns)

Index(['regtno', 'std_name', 'fathername', 'mobilenumber'], dtype='object')

In [35]:
#8.	Write a Pandas program to change the name of the student
df['std_name'][0]='inavars'
df['std_name'].replace('sravani','inavars')
df

C:\Users\y20cs99\AppData\Local\Temp/ipykernel_14316/3224969576.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['std_name'][0]='inavars'

     regtno   std_name fathername  mobilenumber
0  y20cs099    inavars        abc        123456
1  y20cs100     akhila        xyz        498765
2  y20cs101  maheswari        poi        637389
3  y20cs102   bhargavi       hdbk         84840

In [36]:
#9.	Write a Pandas program to insert a new column “grade” in existing DataFrame.
df['grade']=['A+','A+','A+','A+']

In [38]:
df

     regtno   std_name fathername  mobilenumber grade
0  y20cs099    inavars        abc        123456    A+
1  y20cs100     akhila        xyz        498765    A+
2  y20cs101  maheswari        poi        637389    A+
3  y20cs102   bhargavi       hdbk         84840    A+

In [39]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data , index=labels)
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes